fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ПериодНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/ФормаНастройки/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПериодНачало = НачалоМесяца(ТекущаяДата());
	Объект.ПериодКонец = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	СоздатьАкты()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьАкты()
	
	ДлитОпер = НачатьДО();
		
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	
	ПарамОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПарамОжидания.Заголовок = "Формирую акты";
	ПарамОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПарамОжидания.Интервал = 2;
	ПарамОжидания.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлитОпер, Оповещение, ПарамОжидания);
	
КонецПроцедуры	

&НаСервере
Функция НачатьДО()  
		
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАкты", 
		Объект.ПериодНачало, Объект.ПериодКонец);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки; 
	КонецЕсли;
		
	Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Акты созданы %1 шт., обработка завершена", Результат));	
	
	ЗаполнитьДаннымиТЧ();

	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДаннымиТЧ()
	
	Объект.СписокДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Договор КАК Договор
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора";  
	
	Запрос.УстановитьПараметр("ПериодНачало", Объект.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(Объект.ПериодКонец));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();    
	
	Пока Выборка.Следующий() Цикл   
		
		ТабЧасть = Объект.СписокДокументов.Добавить(); 
		ТабЧасть.Договоры = Выборка.Договор;
		ТабЧасть.Реализации = Выборка.Ссылка;
		
	КонецЦикла;	
	
КонецПроцедуры	


#КонецОбласти
